# Connecting to AWS RDS PostgresSQL

In [ ]:
import psycopg2
import pandas as pd

In [162]:
connection = psycopg2.connect(
    host = 'project3.cdr354qikgy9.us-east-2.rds.amazonaws.com',
    port = 5431,
    user = 'NBA',
    password = 'NBAFun23!',
    database='NBA_predictor'
    )

#cursor object interacts and executes the commands on the Postgres database 
cursor=connection.cursor()

In [205]:
#check what is in the database
query = """SELECT * FROM pg_catalog.pg_tables
            WHERE schemaname != 'pg_catalog'
            AND schemaname != 'information_schema';"""
cursor.execute(query)
cursor.fetchall()

[('public', 'cities_test', 'NBA', None, False, False, False, False)]

### Test Table

#### Create Test Table

In [163]:
sqlCreateTable  = "CREATE TABLE Cities_test(id bigint, cityname varchar(128), latitude numeric, longitude numeric);";
cursor.execute(sqlCreateTable);

connection.commit()

In [ ]:
#another example:
#cursor.execute("""CREATE TABLE table_1
                #(column_1 integer, 
                #column_2 float,
                #column_3 varchar(50),
                #column_4 boolean);""");
#Commit table creation
#connection.commit()

#### Insert Values Into Test Table

In [177]:
sqlInsertRow1  = "INSERT INTO Cities_test values(1, 'New York City', 40.73, -73.93)";
cursor.execute(sqlInsertRow1);
sqlInsertRow2  = "INSERT INTO Cities_test values(2, 'Miami', 42, -76)";
cursor.execute(sqlInsertRow2);
connection.commit()

In [ ]:
#data = [1, 2.2, 'three', True]
#insert_query = """INSERT INTO table_8
                   #(column_1, column_2, column_3, column_4)
                   #VALUES (%s, %s, %s, %s);"""
# execute insert
#cursor.execute(insert_query, data)
            
# commit data insert
#connection.commit()

##### Inserting Values from a CSV file

In [ ]:
#inserting .csv files using copy_from() into table  
#with open('passengers.csv', 'r') as row:
    # Skip the header row
    #next(row)
    #cursor.copy_from(row, 'passengers', sep=',')
    
#with open('survival.csv', 'r') as row:
    #next(row) 
    #cursor.copy_from(row, 'survival', sep=',')

#with open('trip_info.csv', 'r') as row:
    #next(row)
    #cursor.copy_from(row, 'tripInfo', sep=',')

In [ ]:
#loading data using pd.read_sql

#def load_data(schema, table):

    #sql_command = "SELECT * FROM {}.{};".format(str(schema), str(table))
    #print (sql_command)

    # Load the data
    #data = pd.read_sql(sql_command, conn)

    #print(data.shape)
    #return (data)

#### Query Test Table Data

In [202]:
#query output as a list of each row
sql = cursor.execute("SELECT * from Cities_test");
rows = cursor.fetchall();
rows

[(1, 'New York City', Decimal('40.73'), Decimal('-73.93')),
 (2, 'Miami', Decimal('42'), Decimal('-76'))]

In [201]:
#read in the query to DataFrame using read_sql

sql = """
SELECT * from Cities_test
"""

pd.read_sql(sql, con=connection)

   id       cityname  latitude  longitude
0   1  New York City     40.73     -73.93
1   2          Miami     42.00     -76.00


#### Drop Test Table

In [210]:
cursor.execute("""DROP TABLE Cities_test""")
connection.commit()

In [209]:
connection.rollback()